In [1]:
# DataFrame join is a convenient method for combining the coloumns of 
# two potentially differently- indexed.

# syntax : DataFrame.join()

In [2]:
import pandas as pd

In [3]:
df0=pd.DataFrame({'Id':[1,2,3,4],
             'Section':['A','B','C','D'],
             'Marks':[30,40,50,60]})
df0

   Id Section  Marks
0   1       A     30
1   2       B     40
2   3       C     50
3   4       D     60

In [4]:
# df0.join()
# Signature:
# df0.join(
#     other: 'DataFrame | Series',
#     on: 'IndexLabel | None' = None,
#     how: 'str' = 'left',
#     lsuffix: 'str' = '',
#     rsuffix: 'str' = '',
#     sort: 'bool' = False,
# ) -> 'DataFrame'

In [5]:
df1 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]})
df1

   A   B
0  1  10
1  2  20
2  3  30

In [6]:
df2 = pd.DataFrame({'C':[4,5,6],
                   'D':[40,50,60]})
df2

   C   D
0  4  40
1  5  50
2  6  60

In [7]:
display(df1,df2)
# It helps to Display a Python object in all frontends.

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [8]:
# join()
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [9]:
# You can also cahnge the order of DataFrame by just Changing the variable
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [10]:
df3 = pd.DataFrame({'A':[1,2,3],
                   'B':[10,20,30]},index = ['a','b','c'])
df3

   A   B
a  1  10
b  2  20
c  3  30

In [11]:
df2

   C   D
0  4  40
1  5  50
2  6  60

In [12]:
display(df3,df2)
# Joining DataFrame of different Index.

   A   B
a  1  10
b  2  20
c  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [13]:
df3.join(df2)
# It will join but the value is not printed .
# Hence we cannot join the DataFarme having different index.

   A   B   C   D
a  1  10 NaN NaN
b  2  20 NaN NaN
c  3  30 NaN NaN

In [14]:
df3 = pd.DataFrame({'A':[1,2],
                   'B':[10,20]},index = ['a','b'])
df3

   A   B
a  1  10
b  2  20

In [15]:
df2 = pd.DataFrame({'C':[4,5,6],
                   'D':[40,50,60]},index=['a','b','c'])
df2

   C   D
a  4  40
b  5  50
c  6  60

In [16]:
display(df2,df3)
# Two Dataframe Having Different Keys Value.

   C   D
a  4  40
b  5  50
c  6  60

   A   B
a  1  10
b  2  20

In [17]:
# Joining Two DataFrame Having Different Keys VAlue.
df2.join(df3)

   C   D    A     B
a  4  40  1.0  10.0
b  5  50  2.0  20.0
c  6  60  NaN   NaN

In [18]:
# here these two data frame is joined but missing value is also shown
# To Handling This problem You have to use 
# How parameter .
df2.join(df3,how='right')
# it will print according to right dataset

   C   D  A   B
a  4  40  1  10
b  5  50  2  20

In [19]:
df2.join(df3,how='outer')
# It will print according to left dataset.

   C   D    A     B
a  4  40  1.0  10.0
b  5  50  2.0  20.0
c  6  60  NaN   NaN

In [20]:
# DataFrame Having Smae Column Names

In [21]:
df2 = pd.DataFrame({'A':[4,5],
                   'D':[40,50]},index=['a','b'])
df3 = pd.DataFrame({'A':[1,2],
                   'B':[10,20]},index = ['a','b'])
df3
display(df2,df3)

   A   D
a  4  40
b  5  50

   A   B
a  1  10
b  2  20

In [22]:
df2.join(df3)

ValueError: columns overlap but no suffix specified: Index(['A'], dtype='object')

In [23]:
# To handling this Problem we have to use Lsuffix
df2.join(df3,lsuffix='_1')
# lsuffix and rsuffix parameter used to handling the problem of overlapping index.

   A_1   D  A   B
a    4  40  1  10
b    5  50  2  20

In [24]:
df2.join(df3,rsuffix='_1')

   A   D  A_1   B
a  4  40    1  10
b  5  50    2  20